<script setup></script>

<template>
  <div class="content">
    <p>
      轉眼已經快一年了，還記得去年，用前端三本柱做了一個至今還是很喜歡的申請表，那時候覺得後端好難，Node
      Js 碰了一點卻完全沒有頭緒，之後還去買了彭彭 Hahow 的 Node 課 ( 真的是鐵粉
      )，還很認真完成了作業。
    </p>
    <p>
      去學習 Go 時第一次碰到 interface
      的概念，看了十次還是不能理解，但在一段時間後，再看就突然好像知道在幹嘛，其實就是
      Go 的 OOP。
    </p>
    <p>
      好像這一年來都是這樣，覺得有些東西這輩子可能都不會弄懂，但就在不斷地嘗試理解後，學習到一點皮毛，然後再逐步深入，希望未來的我都能秉持這種精神。
    </p>
    <br />
    <p>
      最印象深刻的是，上一屆繳交申請後，等待時間是兩週。本來以為不就兩個禮拜，還好啦，結果真的在等的時候，真的是度日如年...
    </p>
  </div>
</template>

<style scoped>
p {
  font-size: 13px;
  color: #c0c0c0;
}
</style>
