<script setup></script>

<template>
  <div class="content">
    <p>
      最近在接受一段療程，本來預期不會太久，但上次回診時醫師描述進一步的處理，感覺待業的狀況又要延長一段時間。
      當下有些失望，畢竟這段空窗期會對之後的面試造成多餘的困擾，看到同學也都成功上岸，難免會對自己產生懷疑，究竟當初去嘗試療程的選擇是不是正確的。
    </p>
    <p>
      不過我並沒有讓失望的心情維持太久，如果趁這段時間精進自己，不為是一個好選擇。
    </p>
    <p class="mt">：那不如，用 Vue 來寫一個自己的網站吧？</p>
    <p>：那不如，我喜歡塔羅牌，來幫自己占卜吧？</p>
    <p class="mb">：那不如，再去丟一次申請煩彭彭吧！</p>
    <p>於是網站就成形了，這段時間也過得非常充實，好像我自己的第四階段。</p>
    <p>然後後面可能還有第五階段、第六階段、第七階段... 光想到就累了 🫠。</p>
  </div>
</template>

<style scoped>
p {
  font-size: 13px;
  color: #c0c0c0;
}
.mt {
  margin-top: 10px;
}
.mb {
  margin-bottom: 10px;
}
</style>
