<script setup></script>

<template>
  <div class="content">
    <p>
      最近在接受一段治療，本來預期不會太久，但上次回診時醫師說明之後的療程，感覺待業的狀況還得持續一段時間。
      聽到的當下有些失望，畢竟跟之前設想的回歸時間稍有落差，這段空窗也會造成之後面試多餘的困擾，而看到同學陸續成功上岸，難免對自己產生懷疑，究竟當初去嘗試療程的選擇是不是正確的。
    </p>
    <p>
      不過我並沒有讓失望的心情維持太久，如果趁這段時間精進自己，不為是一個好選擇。
    </p>
    <p class="close">：閒著也是閒著，那不如，用 Vue 來寫一個自己的網站吧？</p>
    <p class="close">：我喜歡塔羅牌，幫自己占卜看看？</p>
    <p>：對了，再去丟一次申請煩彭彭吧！</p>
    <p>
      於是我的網站就逐步成形了，這段時間也過得非常充實，好像我自己的第四階段。
      <br />
      上次回診是四週前，這次觀察期整整一個月，而我做了一個自己的網站，結果來說倒也沒那麼差。
    </p>
  </div>
</template>

<style scoped>
p {
  margin-bottom: 15px;
}
.mt {
  margin-top: 10px;
}
.mb {
  margin-bottom: 10px;
}
.close {
  margin-bottom: 0;
}
</style>
